[
  {
    "autor": "Prof. Miltin",
    "descricao": "Front-End II",
    "id": 1,
    "texto": "A disciplina de Front-End II com React é uma continuação do estudo de desenvolvimento de interfaces de usuário utilizando a biblioteca React. Neste curso, os alunos irão aprofundar seus conhecimentos em React e aprenderão a construir aplicações web interativas e dinâmicas. Ao longo do curso, os alunos serão guiados por instrutores experientes no desenvolvimento com React, que fornecerão uma combinação de teoria e prática para garantir uma compreensão sólida dos conceitos e técnicas necessárias para criar interfaces de usuário avançadas."
  },
  {
    "autor": "Prof. Bruno",
    "descricao": "UX-Design",
    "id": 2,
    "texto": "A disciplina de UX-Design (User Experience Design) é uma abordagem fundamental para o desenvolvimento de produtos digitais que visam proporcionar experiências de usuário excepcionais. Neste curso, os alunos serão introduzidos aos princípios e práticas do UX-Design, aprendendo a criar interfaces intuitivas, funcionais e cativantes. Ao longo do curso, os alunos terão a oportunidade de explorar as etapas do processo de design centrado no usuário, desde a pesquisa e análise das necessidades dos usuários até a prototipagem e validação das soluções propostas. Serão apresentados métodos e ferramentas essenciais utilizados por profissionais de UX-Design, permitindo que os alunos adquiram habilidades práticas para projetar experiências de usuário memoráveis."
  },
  {
    "autor": "Prof. Áquila",
    "descricao": "Estruturas de Dados",
    "id": 3,
    "texto": "A disciplina de UX-Design (User Experience Design) é uma abordagem fundamental para o desenvolvimento de produtos digitais que visam proporcionar experiências de usuário excepcionais. Neste curso, os alunos serão introduzidos aos princípios e práticas do UX-Design, aprendendo a criar interfaces intuitivas, funcionais e cativantes. Ao longo do curso, os alunos terão a oportunidade de explorar as etapas do processo de design centrado no usuário, desde a pesquisa e análise das necessidades dos usuários até a prototipagem e validação das soluções propostas. Serão apresentados métodos e ferramentas essenciais utilizados por profissionais de UX-Design, permitindo que os alunos adquiram habilidades práticas para projetar experiências de usuário memoráveis."
  }
]
